site/02-Another-Lab.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>More Lab Work</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="More Lab Work"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-08-25"/>
<meta name="author" content="Howard Abrams"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>


<div id="content">
<h1 class="title">More Lab Work</h1>

<p>Let's try another lab mission. The wheels on most RVs are geared
weirdly, and use more energy going backwards than forwards. Each RV
has only so much energy before it needs to dock and recharge.
</p>
<p>
The following console connects to an RV with 30 <i>decabrams</i> of energy
for the wheel engines. Moving forward takes about 1 decabram. Why yes,
this does make the math easy. Ha ha!
</p>
<p>
See how far away you can move the RV with that limited amount of energy.
The <code>rv.left</code> and <code>rv.right</code> take a number of degrees to turn the
RV. So saying <code>rv.left(90)</code> will tell the RV to turn to the left
90°. Make sense?
</p>
<p>
Let's have the RV drive in the largest square we can. The <code>d</code> is what
we call a <i>variable</i>. We can set it to a number and then reuse
it. Change the <code>_</code> in this console to a number, but not too large that
the rover doesn't make it back.
</p>



<pre class="example">rv.connect("1-875E-65297D640A2D")

d = _
rv.forward(d)
rv.left(90)
rv.forward(d)
rv.left(90)
rv.forward(d)
rv.left(90)
rv.forward(d)

rv.dock()
</pre>


<p>
To see your work and the path the RV took, click the <i>Map</i> tab.
</p>
<p>
<a href="03-Lab-Programming.html">Next</a>
</p>


  <link href="styles/ui-darkness/jquery-ui.css" rel="Stylesheet"/>
  <script src="scripts/lib/underscore-min.js" type="text/javascript"></script>
  <script src="scripts/lib/jquery-1.9.1.js" type="text/javascript"></script>
  <script src="scripts/lib/jquery-ui.js"></script>
  <script src="scripts/lib/pen_min.js"></script>
  <script src="scripts/lib/coffee-script.js" type="text/javascript" charset="utf-8"></script>
  <link href="styles/main.css" type="text/css" rel="Stylesheet" />
  <link href="styles/console.css" type="text/css" rel="Stylesheet" />

  <script src="scripts/console.coffee" type="text/coffeescript"></script>
  <script src="scripts/veeps-rv-1.coffee" type="text/coffeescript"></script>


</div>

</body>
</html>
